using System;

namespace CbasHome4Task
{
    /* Задание 5 

        Зайдите на сайт MSDN. Используя поисковые механизмы MSDN, найдите самостоятельно описание темы 
    по каждому примеру, который был рассмотрен на уроке, так, как это представлено ниже, в разделе 
    «Рекомендуемые ресурсы», описания данного урока. Сохраните ссылки и дайте им короткое описание. */
    internal class Program
    {
        //static
        //https://learn.microsoft.com/ru-ru/dotnet/csharp/language-reference/keywords/static?redirectedfrom=MSDN

        //Статические члены и модификатор static
        //https://metanit.com/sharp/tutorial/3.6.php

        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
